<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of iTerm 2 and makes a package. Then, uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github..txhaflaire.jss-upload.iTerm2</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Software - Unlicensed</string>
		<key>NAME</key>
		<string>iTerm2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.pkg.iTerm2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
